Revit 2024 API
ParameterTypeId.StructuralAttachmentTopDistance Property
 "Top Attachment Distance"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StructuralAttachmentTopDistance { get; }
Visual Basic
Public Shared ReadOnly Property StructuralAttachmentTopDistance As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralAttachmentTopDistance {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace